-----
Install Postgre:
https://www.enterprisedb.com/downloads/postgres-postgresql-downloads
<br>Password: pgadmin

pip install sqlalchemy

pip install psycopg2

pip install ipython-sql

pip install ipywidgets

-----

In [2]:
############## Importar os módulos necessários para o Notebook:
from ipywidgets import interact  ##-- Interactors
import ipywidgets as widgets     #---
from sqlalchemy import create_engine

In [3]:
############## Conectar com um servidor SQL na base default ###################### --> Postgres.postgres
%load_ext sql

# Connection format: %sql dialect+driver://username:password@host:port/database
engine = create_engine('postgresql://postgres:pgadmin@localhost:5432/postgres')
%sql postgresql://postgres:pgadmin@localhost:5432/postgres

In [4]:
%%sql SELECT Current_database() --Base onde estamos conectados:
;

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[('postgres',)]

# Exercicio 3

In [47]:
%%sql

-- Entidades:
    
DROP TABLE IF EXISTS Usuario CASCADE;
CREATE TABLE Usuario(
    ID          DECIMAL(8)  not NULL PRIMARY KEY,
    Nome        VARCHAR(40) not NULL,
    Sobrenome   VARCHAR(80) not NULL,
    Telefone    CHAR(10)    not NULL,
    Data_Nascimento DATE,
    Sexo        CHAR(1),
    Endereço    VARCHAR(80),
    Email       VARCHAR(50) not NULL,
    Senha       VARCHAR(20) not NULL
    );

DROP TABLE IF EXISTS ContaBancaria CASCADE;
CREATE TABLE ContaBancaria(
    ID          DECIMAL(8)  not NULL PRIMARY KEY,
    Roteamento  DECIMAL(8)  not NULL,
    Tipo        VARCHAR(20) not NULL,
    Dono        DECIMAL(8)  not NULL,
        FOREIGN KEY (Dono) REFERENCES Usuario (ID)
            ON DELETE CASCADE ON UPDATE CASCADE
    );
    
DROP TABLE IF EXISTS Propriedade CASCADE;
CREATE TABLE Propriedade(
    ID          DECIMAL(8)  not NULL PRIMARY KEY,
    Classificacao DECIMAL(1)  not NULL,
    Endereço    VARCHAR(100) not NULL,
    NroBanheiros DECIMAL(2)  DEFAULT 0,
    NroQuartos  DECIMAL(2)  DEFAULT 0,
    MaxHospedes  DECIMAL(3),
    Diaria      NUMERIC DEFAULT 0,
    Limpeza     NUMERIC DEFAULT 0,
    Min_Noite   Decimal(3) DEFAULT 1,
    Max_Noite   Decimal(3),
    hr_checkin  TIME not NULL,
    hr_checkout TIME not NULL,
    Disponibilidade_inicio DATE not NULL,  
    Disponibilidade_fim DATE not NULL,  
    NroTipoCamas VARCHAR(50),
    Comodidades  VARCHAR(50), 
    Regras       VARCHAR(50),
    Interesses   VARCHAR(50),
    Dono        DECIMAL(8)  not NULL,
        FOREIGN KEY (DONO) REFERENCES Usuario (ID)
            ON DELETE CASCADE ON UPDATE CASCADE
    );

-- Relacoes:
    
DROP TABLE IF EXISTS TrocaMensagem CASCADE;
CREATE TABLE TrocaMensagem(
    Timestamp TIMESTAMP NOT NULL,
    User1     DECIMAL(8) NOT NULL,
    User2     DECIMAL(8) NOT NULL,
    Mensagem  VARCHAR(100) NOT NULL,
        PRIMARY KEY (TimeStamp, User1, User2),
        FOREIGN KEY (User1) REFERENCES Usuario (ID)
            ON DELETE CASCADE ON UPDATE CASCADE,
        FOREIGN KEY (User2) REFERENCES Usuario (ID)
            ON DELETE CASCADE ON UPDATE CASCADE
);

DROP TABLE IF EXISTS Fotos CASCADE;
CREATE TABLE Fotos(
    Timestamp TIMESTAMP NOT NULL,
    User1     DECIMAL(8) NOT NULL,
    User2     DECIMAL(8) NOT NULL,
    Foto      VARCHAR(100) NOT NULL,
        PRIMARY KEY (TimeStamp, User1, User2, Foto),
        FOREIGN KEY (TimeStamp, User1, User2) 
            REFERENCES TrocaMensagem (TimeStamp, User1, User2)
            ON DELETE CASCADE ON UPDATE CASCADE
);

DROP TABLE IF EXISTS Avalia CASCADE;
CREATE TABLE Avalia(
    Timestamp   TIMESTAMP NOT NULL,
    Propriedade DECIMAL(8) NOT NULL,
    Mensagem    VARCHAR(100) NOT NULL,
    Limpeza     Decimal(2) DEFAULT 0,
    Comunicacao Decimal(2) DEFAULT 0,
    Localizacao Decimal(2) DEFAULT 0,
    valor       Decimal(2) DEFAULT 0,
    Hospede DECIMAL(8) NOT NULL,
        PRIMARY KEY (TimeStamp, Hospede, Propriedade),
        FOREIGN KEY (Hospede) REFERENCES Usuario (ID)
            ON DELETE CASCADE ON UPDATE CASCADE,
        FOREIGN KEY (Propriedade) REFERENCES Propriedade (ID)
            ON DELETE CASCADE ON UPDATE CASCADE
);

DROP TABLE IF EXISTS FotosAvaliacao CASCADE;
CREATE TABLE FotosAvaliacao(
    Timestamp TIMESTAMP NOT NULL,
    Hospede      Decimal(8) NOT NULL,
    Propriedade DECIMAL(8) NOT NULL,
    Foto      VARCHAR(100) NOT NULL,
        PRIMARY KEY (TimeStamp, Hospede, Propriedade, Foto),
        FOREIGN KEY (TimeStamp, Hospede, Propriedade) 
            REFERENCES Avalia (TimeStamp, Hospede, Propriedade)
            ON DELETE CASCADE ON UPDATE CASCADE
);


DROP TABLE IF EXISTS Locacao CASCADE;
CREATE TABLE Locacao(
    DataReserva  TIMESTAMP NOT NULL,
    Hospede      DECIMAL(8) NOT NULL,
    Propriedade  DECIMAL(8) NOT NULL,
    Checkin      DATE,
    Checkout     DATE,
    NroHospedes  DECIMAL(3),
    imposto      NUMERIC,
    DESCONTO     NUMERIC,
    COD_PROMO    NUMERIC,
        PRIMARY KEY (DataReserva, Hospede, Propriedade),
        FOREIGN KEY (Hospede) REFERENCES Usuario (ID)
            ON DELETE CASCADE ON UPDATE CASCADE,
        FOREIGN KEY (Propriedade) REFERENCES Propriedade (ID)
            ON DELETE CASCADE ON UPDATE CASCADE
);

 * postgresql://postgres:***@localhost:5432/postgres
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

# Exercicio 4

In [48]:
%%sql

INSERT INTO Usuario 
    VALUES  (1,'John','Snow','12345-6789','01/01/0001','M','SP, street','AAA@mail.com','123'),
            (2,'May','Smith','12345-6789','01/01/0002','F','SP, street','AAA@mail.com','123'),
            (3,'Jack','Daniel','12345-6789','01/01/0003','M','SP, street','AAA@mail.com','123'),
            (4,'Bob','Contructor','12345-6789','01/01/0004','M','SP, street','AAA@mail.com','123'),
            (5,'Will','Smith','12345-6789','01/01/0005','M','SP, street','AAA@mail.com','123'),
            
            (6,'Mike','Aaron','12345-6789','01/01/0006','M','SP, street','AAA@mail.com','123'),
            (7,'Strot','Brit','12345-6789','01/01/0007','M','RJ, street','AAA@mail.com','123'),
            (8,'Jean','Calvin','12345-6789','01/01/0008','F','SP, street','AAA@mail.com','123'),
            (9,'Potato','Door','12345-6789','01/01/0009','F','SP, street','AAA@mail.com','123'),
            (0,'Guy','Falks','12345-6789','01/01/0010','M','SP, street','AAA@mail.com','123');

INSERT INTO ContaBancaria 
    VALUES  (0,0,0,9),
            (1,1,1,9),
            (2,2,0,4),
            (3,3,1,4),
            (4,4,0,8),
            
            (5,0,0,7),
            (6,1,1,6),
            (7,2,0,6),
            (8,3,1,6),
            (9,4,0,6);

INSERT INTO Propriedade (ID, Classificacao, Endereço, Diaria, hr_checkin, 
                         hr_checkout, Disponibilidade_inicio, Disponibilidade_fim, Dono) 
    VALUES  (0,0,'SP, street', 100.00, '11:30', '11:00', '20240101', '20250101', 9),
            (4,0,'SP, street 2', 100.00, '11:30', '11:00', '20240101', '20250101', 9),
            (5,1,'SP, street 3', 100.00, '11:30', '11:00', '20240101', '20250101', 4),
            (6,0,'SP, street 4', 100.00, '11:30', '11:00', '20240101', '20250101', 4),
            (1,1,'SP, 2nd street', 50.50, '11:30', '11:00', '20240101', '20250101', 8),
            
            (2,1,'RJ, 3nd street', 20.00, '11:30', '11:00', '20240101', '20250101', 7),
            (3,2,'RJ, 3nd street 2', 300.00, '11:30', '11:00', '20240101', '20250101', 6),
            (7,0,'RJ, 3nd street 3', 250.00, '11:30', '11:00', '20240101', '20250101', 6),
            (8,1,'RJ, 3nd street 4', 300.00, '11:30', '11:00', '20240101', '20250101', 6),
            (9,2,'RJ, 3nd street 5', 300.00, '11:30', '11:00', '20240101', '20250101', 6);
            
INSERT INTO Locacao (DataReserva, Hospede, Propriedade, Checkin, Checkout)
    VALUES  ('00010101', 0, 0, '20240402', '20240403'),
            ('03330501', 4, 2, '20350407', '20350409'),
            ('03430603', 4, 1, '20240301', '20350302'),
            ('03430604', 4, 2, '20240302', '20350403'),
            ('03430605', 4, 2, '20240304', '20350405'),
            
            ('03430606', 4, 1, '20240305', '20350406'),
            ('03430607', 4, 0, '20240306', '20350407'),
            ('03430608', 4, 0, '20240307', '20350408'),
            ('03430609', 1, 3, '20240308', '20350409'),
            ('03430610', 4, 3, '20240309', '20350410')
            ;

 * postgresql://postgres:***@localhost:5432/postgres
10 rows affected.
10 rows affected.
10 rows affected.
10 rows affected.

[]

# Exercicio 5

Mostre a relação inteira<br>
Mostre quantas Propriedades existem de cada classe (casa inteira, etc.)<br>
Mostre quantas Propriedades existem de cada Cidade.

In [49]:
%sql SELECT * FROM Propriedade;

 * postgresql://postgres:***@localhost:5432/postgres
10 rows affected.

[(Decimal('0'), Decimal('0'), 'SP, street', Decimal('0'), Decimal('0'), None, Decimal('100.00'), Decimal('0'), Decimal('1'), None, datetime.time(11, 30), datetime.time(11, 0), datetime.date(2024, 1, 1), datetime.date(2025, 1, 1), None, None, None, None, Decimal('9')),
 (Decimal('4'), Decimal('0'), 'SP, street 2', Decimal('0'), Decimal('0'), None, Decimal('100.00'), Decimal('0'), Decimal('1'), None, datetime.time(11, 30), datetime.time(11, 0), datetime.date(2024, 1, 1), datetime.date(2025, 1, 1), None, None, None, None, Decimal('9')),
 (Decimal('5'), Decimal('1'), 'SP, street 3', Decimal('0'), Decimal('0'), None, Decimal('100.00'), Decimal('0'), Decimal('1'), None, datetime.time(11, 30), datetime.time(11, 0), datetime.date(2024, 1, 1), datetime.date(2025, 1, 1), None, None, None, None, Decimal('4')),
 (Decimal('6'), Decimal('0'), 'SP, street 4', Decimal('0'), Decimal('0'), None, Decimal('100.00'), Decimal('0'), Decimal('1'), None, datetime.time(11, 30), datetime.time(11, 0), datetime.date(2024, 1, 1), datetime.date(2025, 1, 1), None, None, None, None, Decimal('4')),
 (Decimal('1'), Decimal('1'), 'SP, 2nd street', Decimal('0'), Decimal('0'), None, Decimal('50.50'), Decimal('0'), Decimal('1'), None, datetime.time(11, 30), datetime.time(11, 0), datetime.date(2024, 1, 1), datetime.date(2025, 1, 1), None, None, None, None, Decimal('8')),
 (Decimal('2'), Decimal('1'), 'RJ, 3nd street', Decimal('0'), Decimal('0'), None, Decimal('20.00'), Decimal('0'), Decimal('1'), None, datetime.time(11, 30), datetime.time(11, 0), datetime.date(2024, 1, 1), datetime.date(2025, 1, 1), None, None, None, None, Decimal('7')),
 (Decimal('3'), Decimal('2'), 'RJ, 3nd street 2', Decimal('0'), Decimal('0'), None, Decimal('300.00'), Decimal('0'), Decimal('1'), None, datetime.time(11, 30), datetime.time(11, 0), datetime.date(2024, 1, 1), datetime.date(2025, 1, 1), None, None, None, None, Decimal('6')),
 (Decimal('7'), Decimal('0'), 'RJ, 3nd street 3', Decimal('0'), Decimal('0'), None, Decimal('250.00'), Decimal('0'), Decimal('1'), None, datetime.time(11, 30), datetime.time(11, 0), datetime.date(2024, 1, 1), datetime.date(2025, 1, 1), None, None, None, None, Decimal('6')),
 (Decimal('8'), Decimal('1'), 'RJ, 3nd street 4', Decimal('0'), Decimal('0'), None, Decimal('300.00'), Decimal('0'), Decimal('1'), None, datetime.time(11, 30), datetime.time(11, 0), datetime.date(2024, 1, 1), datetime.date(2025, 1, 1), None, None, None, None, Decimal('6')),
 (Decimal('9'), Decimal('2'), 'RJ, 3nd street 5', Decimal('0'), Decimal('0'), None, Decimal('300.00'), Decimal('0'), Decimal('1'), None, datetime.time(11, 30), datetime.time(11, 0), datetime.date(2024, 1, 1), datetime.date(2025, 1, 1), None, None, None, None, Decimal('6'))]

In [50]:
%%sql SELECT classificacao , count(*)
        FROM Propriedade 
        GROUP BY Classificacao;

 * postgresql://postgres:***@localhost:5432/postgres
3 rows affected.

[(Decimal('2'), 2), (Decimal('1'), 4), (Decimal('0'), 4)]

In [51]:
%%sql 
SELECT 'SP' as Cidade, count(*)
    from Propriedade
    WHERE endereço ~'^SP'
    UNION
SELECT 'RJ' as Cidade, count(*)
    from Propriedade
    WHERE endereço ~'^RJ';

 * postgresql://postgres:***@localhost:5432/postgres
2 rows affected.

[('RJ', 5), ('SP', 5)]

# Exercicio 6

Mostre as loca¸c˜oes que foram confirmadas com check-in a partir de 2024-04-01, indicando para cada uma:<br>
• Todos os atributos-chave das rela¸c˜oes envolvidas,<br>
• O total de dias locado,<br>
• O Nome do anfitri˜ao e o do locat´ario<br>
• O valor da di´aria.

In [52]:
%%sql
SELECT l.DataReserva, l.Hospede, l.Propriedade, l.Checkin, l.Checkout - l.Checkin as dias_locados, 
       u1.nome as Locatario, u2.nome as anfitriao, p.Diaria
    from Locacao l join propriedade p on l.propriedade = p.id
                   join Usuario u1 on l.hospede = u1.id
                   join Usuario u2 on p.dono = u2.id
    WHERE l.checkin > '20240401';

 * postgresql://postgres:***@localhost:5432/postgres
2 rows affected.

[(datetime.datetime(1, 1, 1, 0, 0), Decimal('0'), Decimal('0'), datetime.date(2024, 4, 2), 1, 'Guy', 'Potato', Decimal('100.00')),
 (datetime.datetime(333, 5, 1, 0, 0), Decimal('4'), Decimal('2'), datetime.date(2035, 4, 7), 2, 'Bob', 'Strot', Decimal('20.00'))]

# Exercicio 7

Mostre o valor médio das diárias de todas as locações que foram feitas <br>
e das que foram confirmadas em cada mês para o qual exista alguma locação na base.

In [53]:
%%sql
SELECT ROUND(AVG(p.Diaria), 2) as locacao_AVG
    from locacao l join propriedade p 
    on l.propriedade = p.id
    
-- Funções MONTH(DATE), YEAR(DATE) e FORMAT(...) não existem nessa biblioteca
-- Não consegui fazer o resto do exercicio 7
    ;

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[(Decimal('106.10'),)]

# Exercicio 8

Mostre os anfitriões que tiveram pelo menos 3 locações, mostrando seu nome, sua cidade e quantidade de imóveis dos quais ele é dono.

In [54]:
%%sql
WITH Anfitrioes as (SELECT u.id, u.nome, 'SP' as cidade
                        from Locacao l join propriedade p on l.propriedade = p.id
                                       join Usuario u on p.dono = u.id
                            WHERE u.endereço ~'^SP'
                            GROUP BY u.id
                                HAVING count(*) > 2
                            UNION
                    SELECT u.id, u.nome, 'RJ' as cidade
                        from Locacao l join propriedade p on l.propriedade = p.id
                                       join Usuario u on p.dono = u.id
                            WHERE u.endereço ~'^RJ'
                            GROUP BY u.id
                                HAVING count(*) > 2)

SELECT a.nome, a.cidade, count(*)
    from Anfitrioes a join Propriedade p on p.dono = a.id
        GROUP BY a.id, a.nome, a.cidade

 * postgresql://postgres:***@localhost:5432/postgres
2 rows affected.

[('Strot', 'RJ', 1), ('Potato', 'SP', 2)]

# Exercicio 9

Mostre os usuários que são tanto anfitriões quanto locatários.

In [55]:
%%sql
WITH locatarios as (Select u.id, u.nome, count(*) as viagens from Usuario u join Locacao l
                            on l.hospede = u.id
                            GROUP BY u.id, u.nome)

SELECT l.nome, l.viagens, count(*) as propriedades from locatarios l join propriedade p
        on l.id = p.dono
        GROUP BY l.nome, l.viagens
;

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[('Bob', 8, 2)]

# Exercicio 10

Mostre:<br>
• Os locat´arios que s˜ao mais jovens do que algum anfitri˜ao.<br>
• Os locat´arios que s˜ao mais jovens do que todos os anfitri˜oes

In [56]:
%%sql
WITH anfitrioes as (SELECT min(u.Data_Nascimento) as min, max(u.Data_Nascimento) as max
                        from Usuario u join propriedade p on u.id = p.dono)

SELECT u.nome,  (u.Data_Nascimento < a.max) as jovem, 
                (u.Data_Nascimento < a.min) as super_jovem
    from Usuario u join Locacao l on u.id = l.hospede, anfitrioes a
    GROUP BY u.nome, u.Data_Nascimento, a.max, a.min

 * postgresql://postgres:***@localhost:5432/postgres
3 rows affected.

[('John', True, True), ('Bob', True, False), ('Guy', False, False)]